import React,{ Component } from "react";
import { View,Text  } from "react-native";

class Book1 extends Component{
    render(){
        return(
            <View>
                <Text>序
序 班固
一、汉书亦称前汉书，班固撰。固字孟坚，后汉扶风安陵（故城在今陕西咸阳市东）人，生於光武帝建武八年（公元三二年）。他的父亲班彪字叔皮，生平好述作，专心於史籍。当时有好些人做过司马迁史记的续篇，班彪都觉得不满意，於是博采遗事异闻，作成后传六十五篇。班彪死於建武三十年（公元五四年），班固回到家乡，有志完成父业，就着手这部大著作，那时他才二十三岁。后来有人上书明帝，告他私改国史，他因此被捕下狱，所有的书稿都被抄。他的弟弟班超怕他遭遇危险，赶到洛阳去替他上书辨白，同时当地官吏也把他的书稿送到京师。明帝看过了，觉得他才能卓异，就把他叫到京师，派他做兰台令史（事在永平五年，公元六二年）。兰台是汉朝皇家藏书的地方，有六名官员叫令史，他就是这六员之一。随后他升迁为郎，典校祕书，明帝叫他把他那部没有完成的书继续做下去。从此一连做了二十多年，直到章帝建初的中叶。

和帝永元初，窦宪出击匈奴，以班固为中护军，参与谋议。此后几年，班固都在窦宪幕。窦宪在燕然山刻石勒功，那篇大文章就是班固的手笔。窦宪原是外戚，此番出击匈奴立了功，封了侯，威势更可炙手。因此班固家里的人也不免有仗势欺人的事。有一次洛阳令种兢路遭班固家奴的侮辱，不久之后，窦宪失势自杀，宾客都遭拿问，种兢就趁此逮捕了班固。永元四年（公元九二年），固死在狱中，时年六十一。

他死时，汉书还有八表和天文志没有作成，和帝命其妹班昭参考东观藏书替他补作，又命他的同郡人马续帮助班昭作成天文志。所以这部汉书正如赵翼所指出，是“经过四人（即彪、固、昭、续）手，阅三四十年始成完书”的。</Text>
            </View>
        );
    }
}
export default Book1;